zdfxdxy543/MotorAI/Generate/Example/mcs_pmsm_nt/project/f280039c_Iris_node/F280039_LaunchPad.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28003x" --part "F28003x_100PZ" --package "100PZ" --context "system" --product "gmp_pro@1.00.00.05" --product "C2000WARE@5.03.00.00"
 * @v2CliArgs --device "TMS320F280039C" --package "100PZ" --context "system" --product "gmp_pro@1.00.00.05" --product "C2000WARE@5.03.00.00"
 * @versions {"tool":"1.21.0+3721"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc            = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1           = adc.addInstance();
const adc2           = adc.addInstance();
const adc3           = adc.addInstance();
const analog         = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1        = analog.addInstance();
const can            = scripting.addModule("/driverlib/can.js", {}, false);
const can1           = can.addInstance();
const dac            = scripting.addModule("/driverlib/dac.js", {}, false);
const dac1           = dac.addInstance();
const dac2           = dac.addInstance();
const device_support = scripting.addModule("/driverlib/device_support.js");
const epwm           = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1          = epwm.addInstance();
const epwm2          = epwm.addInstance();
const epwm3          = epwm.addInstance();
const epwm4          = epwm.addInstance();
const epwm5          = epwm.addInstance();
const epwm6          = epwm.addInstance();
const eqep           = scripting.addModule("/driverlib/eqep.js", {}, false);
const eqep1          = eqep.addInstance();
const eqep2          = eqep.addInstance();
const gpio           = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1          = gpio.addInstance();
const gpio2          = gpio.addInstance();
const gpio3          = gpio.addInstance();
const gpio4          = gpio.addInstance();
const sci            = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1           = sci.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc1.adcBase                 = "ADCB_BASE";
adc1.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4"];
adc1.soc0Name                = "J7_IV";
adc1.soc0IndependentNameMode = true;
adc1.soc0Channel             = "ADC_CH_ADCIN5";
adc1.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc0SampleWindow        = 9;
adc1.soc1Name                = "J3_IV";
adc1.soc1IndependentNameMode = true;
adc1.soc1Channel             = "ADC_CH_ADCIN12";
adc1.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc1SampleWindow        = 9;
adc1.soc2Name                = "J7_VW";
adc1.soc2IndependentNameMode = true;
adc1.soc2Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc2Channel             = "ADC_CH_ADCIN8";
adc1.soc2SampleWindow        = 9;
adc1.soc3Name                = "J3_VV";
adc1.soc3IndependentNameMode = true;
adc1.soc3Channel             = "ADC_CH_ADCIN9";
adc1.soc3Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc3SampleWindow        = 9;
adc1.soc4Name                = "J7_VDC";
adc1.soc4Channel             = "ADC_CH_ADCIN11";
adc1.soc4Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc4SampleWindow        = 9;
adc1.soc4IndependentNameMode = true;
adc1.$name                   = "IRIS_ADCB";

adc2.adcClockPrescaler              = "ADC_CLK_DIV_2_0";
adc2.enabledSOCs                    = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4"];
adc2.soc0Name                       = "J3_IU";
adc2.soc0IndependentNameMode        = true;
adc2.soc0Channel                    = "ADC_CH_ADCIN11";
adc2.soc0SampleWindow               = 9;
adc2.soc0Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc1Name                       = "J7_IW";
adc2.soc1SampleWindow               = 9;
adc2.soc1Channel                    = "ADC_CH_ADCIN12";
adc2.soc1Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc2Name                       = "J7_VV";
adc2.soc2SampleWindow               = 9;
adc2.soc2Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc3Name                       = "J3_VU";
adc2.soc3IndependentNameMode        = true;
adc2.soc3Channel                    = "ADC_CH_ADCIN2";
adc2.soc3Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc3SampleWindow               = 9;
adc2.soc4Name                       = "J3_VDC";
adc2.soc4IndependentNameMode        = true;
adc2.soc4Channel                    = "ADC_CH_ADCIN6";
adc2.soc4SampleWindow               = 9;
adc2.soc4Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc2IndependentNameMode        = true;
adc2.soc1IndependentNameMode        = true;
adc2.enabledInts                    = ["ADC_INT_NUMBER1"];
adc2.enableInterrupt1               = true;
adc2.enableInterrupt1ContinuousMode = true;
adc2.registerInterrupts             = ["1"];
adc2.$name                          = "IRIS_ADCA";
adc2.adcInt1.enableInterrupt        = true;
adc2.adcInt1.interruptHandler       = "MainISR";

adc3.adcBase                 = "ADCC_BASE";
adc3.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc3.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3"];
adc3.soc0Name                = "J3_IW";
adc3.soc0IndependentNameMode = true;
adc3.soc0Channel             = "ADC_CH_ADCIN3";
adc3.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc0SampleWindow        = 9;
adc3.soc1Name                = "J7_IU";
adc3.soc1IndependentNameMode = true;
adc3.soc1Channel             = "ADC_CH_ADCIN8";
adc3.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc1SampleWindow        = 9;
adc3.soc2Name                = "J7_VU";
adc3.soc2IndependentNameMode = true;
adc3.soc2Channel             = "ADC_CH_ADCIN10";
adc3.soc2Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc2SampleWindow        = 9;
adc3.soc3Name                = "J3_VW";
adc3.soc3IndependentNameMode = true;
adc3.soc3Channel             = "ADC_CH_ADCIN4";
adc3.soc3Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc3SampleWindow        = 9;
adc3.$name                   = "IRIS_ADCC";

can1.enableInterrupt         = true;
can1.registerInterrupts      = true;
can1.interruptFlags          = ["CAN_INT_IE0"];
can1.interruptLine           = ["CAN_GLOBAL_INT_CANINT0"];
can1.$name                   = "IRIS_CAN";
can1.msgObjsUsed             = [1,2,3,4,5,6,7,8,9,10];
can1.can.$assign             = "CANA";
can1.can.can_rxPin.$assign   = "GPIO5";
can1.can.can_txPin.$assign   = "GPIO4";
can1.can0Int.enableInterrupt = true;
can1.msgObj1.$name           = "msgObj0";
can1.msgObj1.msgID           = 257;
can1.msgObj2.$name           = "msgObj1";
can1.msgObj2.msgID           = 258;
can1.msgObj4.$name           = "msgObj2";
can1.msgObj4.msgID           = 513;
can1.msgObj4.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj5.$name           = "msgObj3";
can1.msgObj5.msgID           = 514;
can1.msgObj5.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj3.$name           = "msgObj4";
can1.msgObj3.msgID           = 259;
can1.msgObj6.$name           = "msgObj5";
can1.msgObj6.msgID           = 515;
can1.msgObj7.$name           = "msgObj6";
can1.msgObj7.msgID           = 516;
can1.msgObj7.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj8.$name           = "msgObj7";
can1.msgObj8.msgID           = 517;
can1.msgObj8.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj9.$name           = "msgObj8";
can1.msgObj9.msgID           = 518;
can1.msgObj9.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj10.$name          = "msgObj9";
can1.msgObj10.msgID          = 519;
can1.msgObj10.msgType        = "CAN_MSG_OBJ_TYPE_TX";

const pinFunction3     = system.clockTree["XTAL"];
pinFunction3.XTAL_Freq = 12;

dac1.$name = "IRIS_DACA";

dac2.$name   = "IRIS_DACB";
dac2.dacBase = "DACB_BASE";

